In [17]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\abhishek sharma\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: pytz>=2017.3 in c:\users\abhishek sharma\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.16.5 in c:\users\abhishek sharma\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\abhishek sharma\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\abhishek sharma\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

# Import libraries

In [2]:
import pandas as pd
import numpy as np
import bs4
import sys
import requests

# Get list of university towns

In [16]:
def list_of_university_towns():
    with open(r'C:\Users\ABHISHEK SHARMA\Downloads\University_towns (1).txt', 'r') as reader:
        lines= reader.readlines()
    reader.close()
    
    unidata= pd.DataFrame(columns=('State', 'RegionName'))
    count= 0
    state= ""
    region= ""
    
    for line in lines:
        line= line.rstrip('n')
        line= line.strip()
        if 'edit' in line:
            state= line.split('[')[0]
        else:
            region=line.split('(',1)[0]
            unidata.loc[count]= [state,region]
            count= count+ 1
            
    return unidata

list_of_university_towns()

           State                 RegionName
0        Alabama                   AuburnÂ
1        Alabama                   DothanÂ
2        Alabama                FairfieldÂ
3        Alabama                 FlorenceÂ
4        Alabama                 HomewoodÂ
..           ...                        ...
828    Wisconsin               WhitewaterÂ
829      Wyoming                  LaramieÂ
830  Puerto Rico   MayagÃ¼ez, Puerto RicoÂ
831  Puerto Rico        Ponce, Puerto Rico
832  Puerto Rico  Rio Piedras, Puerto Rico

[833 rows x 2 columns]

In [4]:
df= pd.read_excel(r'C:\Users\ABHISHEK SHARMA\Downloads\gdplev.xlsx',skiprows=219)
df

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,1999Q4,9899.4,12877.6,Unnamed: 7
0,NaN,NaN,NaN,NaN,2000Q1,10002.9,12924.2,NaN
1,NaN,NaN,NaN,NaN,2000Q2,10247.7,13160.8,NaN
2,NaN,NaN,NaN,NaN,2000Q3,10319.8,13178.4,NaN
3,NaN,NaN,NaN,NaN,2000Q4,10439.0,13260.5,NaN
4,NaN,NaN,NaN,NaN,2001Q1,10472.9,13222.7,NaN
...,...,...,...,...,...,...,...,...
80,NaN,NaN,NaN,NaN,2020Q1,21561.1,19010.8,NaN
81,NaN,NaN,NaN,NaN,2020Q2,19520.1,17302.5,NaN
82,NaN,NaN,NaN,NaN,2020Q3,21170.3,18596.5,NaN
83,NaN,NaN,NaN,NaN,2020Q4,21494.7,18794.4,NaN
84,NaN,NaN,NaN,NaN,2021Q1,22061.5,19086.4,NaN

# Clean dataframe

In [5]:
def clean_GDP_data():
    df= pd.read_excel(r'C:\Users\ABHISHEK SHARMA\Downloads\gdplev.xlsx',skiprows=219)
    df= df.rename(columns={'1999Q4':'Quarter',12877.6:'GDP'})
    df= df[['Quarter','GDP']]
    return df
clean_GDP_data().head()

  Quarter      GDP
0  2000Q1  12924.2
1  2000Q2  13160.8
2  2000Q3  13178.4
3  2000Q4  13260.5
4  2001Q1  13222.7

In [6]:
def recession_start():
    df= clean_GDP_data()
    i=2
    length= len(df['GDP'])
    recession_start= ''
    while i< length:
        if df.GDP[i] < df.GDP[i-1] and df.GDP[i-1] < df.GDP[i-2]:
            recession_start= df.Quarter[i-1]
            break 
        i+=1
    return recession_start
recession_start()

'2008Q3'

In [11]:
def recession_bottom():
    df= pd.read_excel(r'C:\Users\ABHISHEK SHARMA\Downloads\gdplev.xlsx',skiprows=219)
    df= df.rename(columns={'1999Q4':'Quarter',12877.6:'GDP'})
    df= df[['Quarter','GDP']]
                  
    i=2
    length= len(df['GDP'])
    in_recession= False
    recession_bottom=''
    lowest_gdp= 1000000000
    while i< length:
        if df.GDP[i] < df.GDP[i-1] and df.GDP[i-1] < df.GDP[i-2]:
                  in_recession= True
        if in_recession== True and df.GDP[i] < lowest_gdp:
                lowest_gdp= df.GDP[i]
                recession_bottom= df.Quarter[i]
        if in_recession== True and df.GDP[i] > df.GDP[i-1] and df.GDP[i-1] > df.GDP[i-2]:
                  in_recession= False
        i+=1
    return recession_bottom
recession_bottom()

'2009Q2'

## Convert house data to quarters

In [8]:
def convert_house_data_to_quarters():
    states= {
        'AK':'Alaska','AL':'Alabama','AR':'Arkansas','AS':'American Samoa','AZ':'Arizona','CA':'California','CO':'Colorado','CT':'Connecticut','DC':'District of Columbia','DE':'Delaware','FL':'Florida','GA'
             :'Georgia','GU':'Guam','HI':'Hawaii','IA':'Iowa','ID':'Idaho','IL':'Illinois','IN':'Indiana','KS':'Kansas','KY':'Kentucky','LA':'Louisiana','MA':'Massachusetts','MD':'Maryland','ME':'Maine','MI':'Michigan','MN':'Minnesota','MO':'Missouri','MP':'Northern Mariana Islands','MS':'Mississippi','MT':'Montana','NA':'National','NC':'North Carolina'
    }
    
    house= pd.read_csv(r'C:\Users\ABHISHEK SHARMA\Downloads\City_Zhvi_AllHomes.csv')
    house['State'].replace(states,inplace= True)
    house= house.set_index(["State","RegionName"])
    house= house.iloc[:,49:250]
    
    def quarters(col):
        if col.endswith(("01","02","03")):
            s= col[:4]+ "q1"
        elif col.endswith(("04","05","06")):
            s= col[:4]+ "q2"
        elif col.endswith(("07","08","09")):
            s= col[:4]+ "q3"
        else:
            s= col[:4]+ "q4"
        return s
    
    print(house)
    house= house.groupby(quarters,axis=1).mean()
    print(house.groupby(quarters,axis=1).mean())
    house= house.sort_index()
    return house
                
        

convert_house_data_to_quarters()

                         1999-08-31  1999-09-30  1999-10-31  1999-11-30  \
State       RegionName
NY          New York       224705.0    226911.0    228704.0    230438.0
California  Los Angeles    227833.0    228984.0    230138.0    231957.0
TX          Houston        105728.0    106193.0    106598.0    107025.0
Illinois    Chicago        161674.0    162512.0    163387.0    164519.0
TX          San Antonio    102525.0    102869.0    103193.0    103574.0
...                             ...         ...         ...         ...
Minnesota   Winton              NaN         NaN         NaN         NaN
Mississippi Eastabuchie         NaN         NaN         NaN         NaN
TX          Dean                NaN         NaN         NaN         NaN
Georgia     Pulaski             NaN         NaN         NaN         NaN
PA          New Paris           NaN         NaN         NaN         NaN

                         1999-12-31  2000-01-31  2000-02-29  2000-03-31  \
State       RegionName
NY          New York       232207.0    234131.0    236741.0    239712.0
California  Los Angeles    233760.0    235520.0    237065.0    239037.0
TX          Houston        107515.0    107941.0    108083.0    108027.0
Illinois    Chicago        165858.0    167642.0    169335.0    171126.0
TX          San Antonio    103949.0    104227.0    104412.0    104482.0
...                             ...         ...         ...         ...
Minnesota   Winton              NaN         NaN         NaN         NaN
Mississippi Eastabuchie         NaN         NaN         NaN         NaN
TX          Dean                NaN         NaN         NaN         NaN
Georgia     Pulaski             NaN         NaN         NaN         NaN
PA          New Paris           NaN         NaN         NaN         NaN

                         2000-04-30  2000-05-31  ...  2015-07-31  2015-08-31  \
State       RegionName                           ...
NY          New York       242688.0    245468.0  ...    515516.0    518826.0
California  Los Angeles    241083.0    243424.0  ...    566876.0    569628.0
TX          Houston        108068.0    108085.0  ...    160485.0    160989.0
Illinois    Chicago        172721.0    174434.0  ...    226575.0    227390.0
TX          San Antonio    104524.0    103866.0  ...    147433.0    148906.0
...                             ...         ...  ...         ...         ...
Minnesota   Winton              NaN         NaN  ...     70932.0     71578.0
Mississippi Eastabuchie         NaN         NaN  ...     61003.0     61503.0
TX          Dean                NaN         NaN  ...    142794.0    143746.0
Georgia     Pulaski             NaN         NaN  ...     70793.0     71112.0
PA          New Paris           NaN         NaN  ...    119704.0    120055.0

                         2015-09-30  2015-10-31  2015-11-30  2015-12-31  \
State       RegionName
NY          New York       521580.0    524595.0    528104.0    531372.0
California  Los Angeles    572582.0    577344.0    581154.0    586803.0
TX          Houston        161435.0    162239.0    162693.0    163195.0
Illinois    Chicago        228045.0    228285.0    228738.0    229794.0
TX          San Antonio    149977.0    151001.0    151516.0    152312.0
...                             ...         ...         ...         ...
Minnesota   Winton          71566.0     72035.0     70837.0     69376.0
Mississippi Eastabuchie     61988.0     62413.0     62001.0     61484.0
TX          Dean           144391.0    144496.0    144022.0    143835.0
Georgia     Pulaski         71334.0     71594.0     71921.0     72371.0
PA          New Paris      120178.0    120682.0    121287.0    121866.0

                         2016-01-31  2016-02-29  2016-03-31  2016-04-30
State       RegionName
NY          New York       534094.0    536566.0    538825.0    541981.0
California  Los Angeles    589990.0    593866.0    596180.0    602443.0
TX          Houston        164085.0    165026.0    165626.0    165695.0
Illinois    Chicago        231084.0    233137.0    234677.0    235835.0
TX          San Antonio    153074.0    153465.0    154122.0    155197.0
...                             ...         ...         ...         ...
Minnesota   Winton          68674.0     70155.0     71401.0     71007.0
Mississippi Eastabuchie     62126.0     63003.0     64294.0     64483.0
TX          Dean           144340.0    145625.0    146608.0    147414.0
Georgia     Pulaski         73565.0     74619.0     75473.0     75764.0
PA          New Paris      121909.0    122249.0    122858.0    123388.0

[26122 rows x 201 columns]
                           1999q4         2000q4         2001q4  \
State       RegionName
NY          New York     228593.0  249139.750000  281510.416667
California  Los Angeles  230534.4  246646.666667  272932.750000
TX          Houston      106611.8  108752.750000  110750.000000
Illinois    Chicago      163590.0  176707.500000  196319.500000
TX          San Antonio  103222.0  103312.583333  101636.750000
...                           ...            ...            ...
Minnesota   Winton            NaN   78997.600000   67639.000000
Mississippi Eastabuchie       NaN            NaN            NaN
TX          Dean              NaN            NaN            NaN
Georgia     Pulaski           NaN            NaN            NaN
PA          New Paris         NaN            NaN            NaN

                                2002q4         2003q4         2004q4  \
State       RegionName
NY          New York     304736.416667  339288.333333  381570.250000
California  Los Angeles  311886.333333  372753.500000  466785.916667
TX          Houston      114336.416667  117960.666667  125125.166667
Illinois    Chicago      214496.000000  233192.666667  256077.666667
TX          San Antonio  102871.833333  105901.916667  113911.250000
...                                ...            ...            ...
Minnesota   Winton        56502.500000   54573.666667   54384.416667
Mississippi Eastabuchie            NaN            NaN            NaN
TX          Dean                   NaN            NaN            NaN
Georgia     Pulaski                NaN            NaN            NaN
PA          New Paris              NaN            NaN            NaN

                                2005q4         2006q4         2007q4  \
State       RegionName
NY          New York     445154.916667  501297.333333  503743.666667
California  Los Angeles  570768.666667  647743.666667  639100.583333
TX          Houston      130910.416667  132770.666667  136191.416667
Illinois    Chicago      284519.666667  308761.666667  310963.666667
TX          San Antonio  120266.583333  126084.333333  134981.083333
...                                ...            ...            ...
Minnesota   Winton        64958.000000   66006.166667   70178.083333
Mississippi Eastabuchie            NaN            NaN            NaN
TX          Dean                   NaN            NaN  129817.916667
Georgia     Pulaski                NaN            NaN            NaN
PA          New Paris              NaN            NaN            NaN

                                2008q4         2009q4         2010q4  \
State       RegionName
NY          New York     488697.166667  444978.416667  433684.833333
California  Los Angeles  535090.083333  444078.333333  440036.666667
TX          Houston      133698.750000  129380.666667  127943.333333
Illinois    Chicago      289974.166667  246605.750000  224481.416667
TX          San Antonio  136371.333333  131100.666667  129910.500000
...                                ...            ...            ...
Minnesota   Winton        72139.500000   65785.750000   65426.583333
Mississippi Eastabuchie   60406.916667   59656.666667   60380.833333
TX          Dean         134308.833333  130301.666667  124769.916667
Georgia     Pulaski                NaN            NaN   60449.916667
PA          New Paris              NaN            NaN            NaN

                                2011q4         2012q4         2013q4  \
State       RegionName
NY          New York     433201.666667  430183.833333  447865.166667
California  Los Angeles  413432.166667  409254.000000  484787.666667
TX          Houston      121389.333333  120650.833333  130601.416667
Illinois    Chicago      200012.750000  184768.333333  197521.416667
TX          San Antonio  124949.000000  125061.583333  130083.083333
...                                ...            ...            ...
Minnesota   Winton        62254.916667   69829.333333   74323.083333
Mississippi Eastabuchie   58997.583333   58364.500000   59321.333333
TX          Dean         123392.416667  123233.916667  128461.500000
Georgia     Pulaski       58907.583333   58984.916667   62243.833333
PA          New Paris              NaN            NaN            NaN

                                2014q4         2015q4     2016q4
State       RegionName
NY          New York     481824.250000  513606.416667  537866.50
California  Los Angeles  535081.833333  566422.916667  595619.75
TX          Houston      145673.083333  159564.250000  165108.00
Illinois    Chicago      215255.916667  225654.250000  233683.25
TX          San Antonio  137971.750000  147362.333333  153964.50
...                                ...            ...        ...
Minnesota   Winton        65203.583333   71796.416667   70309.25
Mississippi Eastabuchie   58290.583333   61096.583333   63476.50
TX          Dean         135337.833333  142198.250000  145996.75
Georgia     Pulaski       64400.333333   70028.500000   74855.25
PA          New Paris    118607.750000  120878.666667  122601.00

[26122 rows x 18 columns]

                      1999q4         2000q4         2001q4         2002q4  \
State   RegionName
Alabama Abbeville    47568.8   49173.666667   51205.333333   54767.583333
        Adamsville   67205.8   69861.333333   71605.333333   73529.666667
        Addison      65977.2   65180.333333   70034.333333   77223.000000
        Akron            NaN            NaN            NaN            NaN
        Alabaster   137687.8  140043.666667  142850.833333  146390.916667
...                      ...            ...            ...            ...
WY      Wheatland        NaN            NaN            NaN            NaN
        Wilson           NaN            NaN            NaN            NaN
        Worland          NaN            NaN            NaN            NaN
        Wright           NaN            NaN            NaN            NaN
        Yoder            NaN            NaN            NaN            NaN

                           2003q4         2004q4         2005q4  \
State   RegionName
Alabama Abbeville    59649.666667   64456.500000   70338.666667
        Adamsville   74643.500000   77587.166667   82324.250000
        Addison      81260.833333   83947.666667   91953.666667
        Akron                 NaN   56156.000000   63908.000000
        Alabaster   149817.000000  155345.250000  162057.583333
...                           ...            ...            ...
WY      Wheatland             NaN            NaN  116398.888889
        Wilson                NaN            NaN  809505.500000
        Worland               NaN            NaN  113450.333333
        Wright                NaN            NaN  180784.727273
        Yoder                 NaN            NaN            NaN

                           2006q4        2007q4        2008q4        2009q4  \
State   RegionName
Alabama Abbeville    76386.166667  8.098833e+04  8.346125e+04  8.392067e+04
        Adamsville   86701.333333  9.316717e+04  8.814592e+04  7.940200e+04
        Addison      99892.833333  1.076549e+05  1.066039e+05  9.793442e+04
        Akron        70061.666667  7.033550e+04  6.791992e+04  5.859733e+04
        Alabaster   173053.833333  1.775070e+05  1.717838e+05  1.637992e+05
...                           ...           ...           ...           ...
WY      Wheatland   132801.916667  1.365953e+05  1.391387e+05  1.417987e+05
        Wilson      999670.250000  1.084756e+06  1.092029e+06  1.055497e+06
        Worland     120530.666667  1.286812e+05  1.329652e+05  1.354898e+05
        Wright      209345.166667  2.109474e+05  2.125706e+05  2.095042e+05
        Yoder                 NaN           NaN  1.552416e+05  1.510840e+05

                           2010q4         2011q4         2012q4  \
State   RegionName
Alabama Abbeville    84710.250000   79271.333333   78588.250000
        Adamsville   77138.666667   74243.333333   66537.416667
        Addison      91275.250000   88388.000000   86155.416667
        Akron        53457.416667   51660.166667   56226.000000
        Alabaster   160566.000000  151540.166667  149915.250000
...                           ...            ...            ...
WY      Wheatland   141144.583333  147012.083333  149063.333333
        Wilson      980667.166667  911948.500000  978975.083333
        Worland     134067.250000  134587.916667  136381.083333
        Wright      204893.333333  200651.250000  206225.666667
        Yoder       150290.666667  151046.833333  158652.083333

                           2013q4        2014q4        2015q4      2016q4
State   RegionName
Alabama Abbeville    77234.583333  7.781442e+04  8.012017e+04    81612.25
        Adamsville   71674.500000  7.200858e+04  7.576458e+04    78005.25
        Addison      84797.750000  8.376650e+04  8.427867e+04    81823.25
        Akron        61319.416667  6.098192e+04  5.572492e+04    58501.00
        Alabaster   155660.750000  1.587604e+05  1.624648e+05   165551.00
...                           ...           ...           ...         ...
WY      Wheatland   154818.333333  1.624625e+05  1.709633e+05   176606.50
        Wilson      977126.583333  1.025987e+06  1.069639e+06  1094307.00
        Worland     140005.500000  1.451744e+05  1.500307e+05   152410.25
        Wright      212240.250000  2.193401e+05  2.256933e+05   229034.75
        Yoder       169359.000000  1.749768e+05  1.819638e+05   188178.00

[26122 rows x 18 columns]

In [9]:
unitowns= get_list_of_university_towns()
unitowns= unitowns.set_index(['State','RegionName'])
housingdata= convert_house_data_to_quarters() 

housingdata['2008q2']= housingdata['2008q2']/housingdata['2009q2']
housingdata= housingdata['2008q2'].to_frame()
housingdata= housingdata.dropna()

                         1999-08-31  1999-09-30  1999-10-31  1999-11-30  \
State       RegionName
NY          New York       224705.0    226911.0    228704.0    230438.0
California  Los Angeles    227833.0    228984.0    230138.0    231957.0
TX          Houston        105728.0    106193.0    106598.0    107025.0
Illinois    Chicago        161674.0    162512.0    163387.0    164519.0
TX          San Antonio    102525.0    102869.0    103193.0    103574.0
...                             ...         ...         ...         ...
Minnesota   Winton              NaN         NaN         NaN         NaN
Mississippi Eastabuchie         NaN         NaN         NaN         NaN
TX          Dean                NaN         NaN         NaN         NaN
Georgia     Pulaski             NaN         NaN         NaN         NaN
PA          New Paris           NaN         NaN         NaN         NaN

                         1999-12-31  2000-01-31  2000-02-29  2000-03-31  \
State       RegionName
NY          New York       232207.0    234131.0    236741.0    239712.0
California  Los Angeles    233760.0    235520.0    237065.0    239037.0
TX          Houston        107515.0    107941.0    108083.0    108027.0
Illinois    Chicago        165858.0    167642.0    169335.0    171126.0
TX          San Antonio    103949.0    104227.0    104412.0    104482.0
...                             ...         ...         ...         ...
Minnesota   Winton              NaN         NaN         NaN         NaN
Mississippi Eastabuchie         NaN         NaN         NaN         NaN
TX          Dean                NaN         NaN         NaN         NaN
Georgia     Pulaski             NaN         NaN         NaN         NaN
PA          New Paris           NaN         NaN         NaN         NaN

                         2000-04-30  2000-05-31  ...  2015-07-31  2015-08-31  \
State       RegionName                           ...
NY          New York       242688.0    245468.0  ...    515516.0    518826.0
California  Los Angeles    241083.0    243424.0  ...    566876.0    569628.0
TX          Houston        108068.0    108085.0  ...    160485.0    160989.0
Illinois    Chicago        172721.0    174434.0  ...    226575.0    227390.0
TX          San Antonio    104524.0    103866.0  ...    147433.0    148906.0
...                             ...         ...  ...         ...         ...
Minnesota   Winton              NaN         NaN  ...     70932.0     71578.0
Mississippi Eastabuchie         NaN         NaN  ...     61003.0     61503.0
TX          Dean                NaN         NaN  ...    142794.0    143746.0
Georgia     Pulaski             NaN         NaN  ...     70793.0     71112.0
PA          New Paris           NaN         NaN  ...    119704.0    120055.0

                         2015-09-30  2015-10-31  2015-11-30  2015-12-31  \
State       RegionName
NY          New York       521580.0    524595.0    528104.0    531372.0
California  Los Angeles    572582.0    577344.0    581154.0    586803.0
TX          Houston        161435.0    162239.0    162693.0    163195.0
Illinois    Chicago        228045.0    228285.0    228738.0    229794.0
TX          San Antonio    149977.0    151001.0    151516.0    152312.0
...                             ...         ...         ...         ...
Minnesota   Winton          71566.0     72035.0     70837.0     69376.0
Mississippi Eastabuchie     61988.0     62413.0     62001.0     61484.0
TX          Dean           144391.0    144496.0    144022.0    143835.0
Georgia     Pulaski         71334.0     71594.0     71921.0     72371.0
PA          New Paris      120178.0    120682.0    121287.0    121866.0

                         2016-01-31  2016-02-29  2016-03-31  2016-04-30
State       RegionName
NY          New York       534094.0    536566.0    538825.0    541981.0
California  Los Angeles    589990.0    593866.0    596180.0    602443.0
TX          Houston        164085.0    165026.0    165626.0    165695.0
Illinois    Chicago        231084.0    233137.0    234677.0    235835.0
TX          San Antonio    153074.0    153465.0    154122.0    155197.0
...                             ...         ...         ...         ...
Minnesota   Winton          68674.0     70155.0     71401.0     71007.0
Mississippi Eastabuchie     62126.0     63003.0     64294.0     64483.0
TX          Dean           144340.0    145625.0    146608.0    147414.0
Georgia     Pulaski         73565.0     74619.0     75473.0     75764.0
PA          New Paris      121909.0    122249.0    122858.0    123388.0

[26122 rows x 201 columns]
                           1999q4         2000q4         2001q4  \
State       RegionName
NY          New York     228593.0  249139.750000  281510.416667
California  Los Angeles  230534.4  246646.666667  272932.750000
TX          Houston      106611.8  108752.750000  110750.000000
Illinois    Chicago      163590.0  176707.500000  196319.500000
TX          San Antonio  103222.0  103312.583333  101636.750000
...                           ...            ...            ...
Minnesota   Winton            NaN   78997.600000   67639.000000
Mississippi Eastabuchie       NaN            NaN            NaN
TX          Dean              NaN            NaN            NaN
Georgia     Pulaski           NaN            NaN            NaN
PA          New Paris         NaN            NaN            NaN

                                2002q4         2003q4         2004q4  \
State       RegionName
NY          New York     304736.416667  339288.333333  381570.250000
California  Los Angeles  311886.333333  372753.500000  466785.916667
TX          Houston      114336.416667  117960.666667  125125.166667
Illinois    Chicago      214496.000000  233192.666667  256077.666667
TX          San Antonio  102871.833333  105901.916667  113911.250000
...                                ...            ...            ...
Minnesota   Winton        56502.500000   54573.666667   54384.416667
Mississippi Eastabuchie            NaN            NaN            NaN
TX          Dean                   NaN            NaN            NaN
Georgia     Pulaski                NaN            NaN            NaN
PA          New Paris              NaN            NaN            NaN

                                2005q4         2006q4         2007q4  \
State       RegionName
NY          New York     445154.916667  501297.333333  503743.666667
California  Los Angeles  570768.666667  647743.666667  639100.583333
TX          Houston      130910.416667  132770.666667  136191.416667
Illinois    Chicago      284519.666667  308761.666667  310963.666667
TX          San Antonio  120266.583333  126084.333333  134981.083333
...                                ...            ...            ...
Minnesota   Winton        64958.000000   66006.166667   70178.083333
Mississippi Eastabuchie            NaN            NaN            NaN
TX          Dean                   NaN            NaN  129817.916667
Georgia     Pulaski                NaN            NaN            NaN
PA          New Paris              NaN            NaN            NaN

                                2008q4         2009q4         2010q4  \
State       RegionName
NY          New York     488697.166667  444978.416667  433684.833333
California  Los Angeles  535090.083333  444078.333333  440036.666667
TX          Houston      133698.750000  129380.666667  127943.333333
Illinois    Chicago      289974.166667  246605.750000  224481.416667
TX          San Antonio  136371.333333  131100.666667  129910.500000
...                                ...            ...            ...
Minnesota   Winton        72139.500000   65785.750000   65426.583333
Mississippi Eastabuchie   60406.916667   59656.666667   60380.833333
TX          Dean         134308.833333  130301.666667  124769.916667
Georgia     Pulaski                NaN            NaN   60449.916667
PA          New Paris              NaN            NaN            NaN

                                2011q4         2012q4         2013q4  \
State       RegionName
NY          New York     433201.666667  430183.833333  447865.166667
California  Los Angeles  413432.166667  409254.000000  484787.666667
TX          Houston      121389.333333  120650.833333  130601.416667
Illinois    Chicago      200012.750000  184768.333333  197521.416667
TX          San Antonio  124949.000000  125061.583333  130083.083333
...                                ...            ...            ...
Minnesota   Winton        62254.916667   69829.333333   74323.083333
Mississippi Eastabuchie   58997.583333   58364.500000   59321.333333
TX          Dean         123392.416667  123233.916667  128461.500000
Georgia     Pulaski       58907.583333   58984.916667   62243.833333
PA          New Paris              NaN            NaN            NaN

                                2014q4         2015q4     2016q4
State       RegionName
NY          New York     481824.250000  513606.416667  537866.50
California  Los Angeles  535081.833333  566422.916667  595619.75
TX          Houston      145673.083333  159564.250000  165108.00
Illinois    Chicago      215255.916667  225654.250000  233683.25
TX          San Antonio  137971.750000  147362.333333  153964.50
...                                ...            ...        ...
Minnesota   Winton        65203.583333   71796.416667   70309.25
Mississippi Eastabuchie   58290.583333   61096.583333   63476.50
TX          Dean         135337.833333  142198.250000  145996.75
Georgia     Pulaski       64400.333333   70028.500000   74855.25
PA          New Paris    118607.750000  120878.666667  122601.00

[26122 rows x 18 columns]

KeyError: '2008q2'

## Run t-test

In [15]:
def run_ttest():
    gt= get_list_of_university_towns()
    dt= convert_house_data_to_quarters()
    gt= gt.set_index(['State','RegionName'])
    good= ''
    
    list= dt.index.list(gt.index).astype(bool)
    dt.insert(loc=0, column='univ',value=list)
    
    univ_town= dt[dt['univ']== True]
    non_univ_town= dt[dt['univ']== False]
    
    univ_ratio= univ_town[recession_start()]/ univ_town[recession_bottom()]
    non_univ_ratio=  non_univ_town[recession_start()]/ non_univ_town[recession_bottom()]
    p_value= ttest_ind(univ_ratio.dropna(), non_univ_ratio.dropna())[1]
    difference= p_value< .01
    
    if univ_ratio.mean()< non_univ_ratio.mean():
        good= 'university town'
        
    else:
            good= 'non university town'
            
    return (difference,p_value, good)

run_ttest